4.9 PART 1

In [1]:
#importing libraries

import pandas as pd
import numpy as np
import os
import matplotlib.pyplot as plt
import seaborn as sns
import scipy

Importing data

In [2]:
path = r'C:\Users\25670\Desktop\Intercart Basket Analysis16.07.2024'

In [3]:
path

'C:\\Users\\25670\\Desktop\\Intercart Basket Analysis16.07.2024'

In [4]:
# importing dataframe
df = pd.read_csv(os.path.join(path, '02 Data', 'Original Data', 'customers.csv'))

In [5]:
df_sub = df.iloc[0 :1500000,]

In [6]:
df_sub.shape

(206209, 10)

WRANGLING

In [7]:
df_sub.head()

,user_id,First Name,Surnam,Gender,STATE,Age,date_joined,n_dependants,fam_status,income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [9]:
# renaming columns
df_sub = df_sub.rename(columns={ 
    'Surnam' : 'Last Name', 
    'STATE' : 'State', 
    'date_joined' : 'Date Joined', 
    'n_dependants' : 'Number of Dependents', 
    'fam_status' : 'Family Status', 
    'income' : 'Income'})

In [10]:
df_sub = df_sub.rename(columns={'User ID' : 'user_id'})

In [11]:
df_sub.head()

,user_id,First Name,Last Name,Gender,State,Age,Date Joined,Number of Dependents,Family Status,Income
0,26711,Deborah,Esquivel,Female,Missouri,48,1/1/2017,3,married,165665
1,33890,Patricia,Hart,Female,New Mexico,36,1/1/2017,0,single,59285
2,65803,Kenneth,Farley,Male,Idaho,35,1/1/2017,2,married,99568
3,125935,Michelle,Hicks,Female,Iowa,40,1/1/2017,0,single,42049
4,130797,Ann,Gilmore,Female,Maryland,26,1/1/2017,1,married,40374

In [12]:
df_sub.describe()

             user_id            Age  Number of Dependents         Income
count  206209.000000  206209.000000         206209.000000  206209.000000
mean   103105.000000      49.501646              1.499823   94632.852548
std     59527.555167      18.480962              1.118433   42473.786988
min         1.000000      18.000000              0.000000   25903.000000
25%     51553.000000      33.000000              0.000000   59874.000000
50%    103105.000000      49.000000              1.000000   93547.000000
75%    154657.000000      66.000000              3.000000  124244.000000
max    206209.000000      81.000000              3.000000  593901.000000

In [13]:
# finding missing values
missing_values = df_sub.isnull().sum()

In [14]:
missing_values

user_id                     0
First Name              11259
Last Name                   0
Gender                      0
State                       0
Age                         0
Date Joined                 0
Number of Dependents        0
Family Status               0
Income                      0
dtype: int64

In [15]:
# finding duplicate rows
duplicates = df_sub.duplicated()

In [16]:
# summing up the total number of duplicates
num_duplicates = duplicates.sum()

In [17]:
num_duplicates

0

As we can see we have no duplicates

In [18]:
# finding column types
df_sub.dtypes

user_id                  int64
First Name              object
Last Name               object
Gender                  object
State                   object
Age                      int64
Date Joined             object
Number of Dependents     int64
Family Status           object
Income                   int64
dtype: object

Combining dataframes

In [19]:
# importing dataframe
df_ords_prods_merge_sub = pd.read_pickle(os.path.join(path, '02 Data', 'Prepared Data', 'aggregated_ords_prods_merge.pkl'))

In [20]:
# Combining customer with df_ords_prods_merge
merged_df_sub = pd.merge(df_ords_prods_merge_sub, df_sub, on='user_id', how='inner')

In [21]:
# checking merge
merged_df_sub.head()

,Unnamed: 0_x,product_id,product_name,aisle_id,department_id,prices,Unnamed: 0.1,Unnamed: 0_y,order_id,user_id,...,busiest_period_of_day,First Name,Last Name,Gender,State,Age,Date Joined,Number of Dependents,Family Status,Income
0,0,1,Chocolate Sandwich Cookies,61,19,5.8,1987,1987,3139998,138,...,Regularly busy,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
1,0,1,Chocolate Sandwich Cookies,61,19,5.8,1989,1989,1977647,138,...,Regularly busy,Charles,Cox,Male,Minnesota,81,8/1/2019,1,married,49620
2,0,1,Chocolate Sandwich Cookies,61,19,5.8,11433,11433,389851,709,...,Busiest day,Deborah,Glass,Female,Vermont,66,6/16/2018,2,married,158302
3,0,1,Chocolate Sandwich Cookies,61,19,5.8,12198,12198,652770,764,...,Regularly busy,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308
4,0,1,Chocolate Sandwich Cookies,61,19,5.8,12200,12200,1813452,764,...,Least busy,Heather,Myers,Female,Wisconsin,40,2/9/2020,3,married,31308

In [22]:
merged_df_sub.shape

(1000000, 29)

In [23]:
#exporting as a pickle
merged_df_sub.to_pickle(os.path.join(path, '02 Data','Prepared Data', 'ords_prods_cust_merge.pkl'))